Управление_закупками/src/InformationRegisters/ДолжностиСотрудников/ДолжностиСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДолжностиСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Должность</name>
    <type>
      <types>DefinedType.Должность</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_закупками/src/CommonModules/КадрыСервер/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ТекущийСотрудник() Экспорт
	
	Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
	Возврат Сотрудник;
	
КонецФункции

Функция ДолжностьСотрудникаНаДату(Сотрудник, Дата) Экспорт 
	
	ДолжностьСотрудника = Неопределено;
	
	Если Сотрудник = Неопределено  
		Или ТипЗнч(Сотрудник) <> Тип("СправочникСсылка.Сотрудники") Тогда  
		
		Возврат Неопределено;   
		
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(ДолжностиСотрудниковСрезПоследних.Должность, НЕОПРЕДЕЛЕНО) КАК Должность
	|ИЗ
	|	РегистрСведений.ДолжностиСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ДолжностиСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ДолжностьСотрудника = Выборка.Должность;
		
	КонецЕсли;
	
	Возврат ДолжностьСотрудника;
	
КонецФункции

#КонецОбласти
